{"format": "graph-model", "generatedBy": "2.18.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "signature": {"inputs": {"keras_tensor_254": {"name": "keras_tensor_254:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "150"}, {"size": "150"}, {"size": "1"}]}}}, "outputs": {"output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "16"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/sequential_1_1/conv2d_1_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "1"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/conv2d_1_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/separable_conv2d_3_1/separable_conv2d/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/separable_conv2d_3_1/separable_conv2d/ReadVariableOp_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "32"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/separable_conv2d_3_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/batch_normalization_3_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/batch_normalization_3_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/separable_conv2d_4_1/separable_conv2d/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/separable_conv2d_4_1/separable_conv2d/ReadVariableOp_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/separable_conv2d_4_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/batch_normalization_4_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/batch_normalization_4_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/separable_conv2d_5_1/separable_conv2d/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/separable_conv2d_5_1/separable_conv2d/ReadVariableOp_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/separable_conv2d_5_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/batch_normalization_5_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/batch_normalization_5_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/global_average_pooling2d_1_1/Mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_3_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_3_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_4_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_4_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_5_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_5_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "keras_tensor_254", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "150"}, {"size": "150"}, {"size": "1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/conv2d_1_1/Relu", "op": "_FusedConv2D", "input": ["keras_tensor_254", "StatefulPartitionedCall/sequential_1_1/conv2d_1_1/convolution/ReadVariableOp", "StatefulPartitionedCall/sequential_1_1/conv2d_1_1/Squeeze"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/max_pooling2d_4_1/MaxPool2d", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_1_1/conv2d_1_1/Relu"], "attr": {"ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "padding": {"s": "VkFMSUQ="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/separable_conv2d_3_1/separable_conv2d/depthwise", "op": "DepthwiseConv2dNative", "input": ["StatefulPartitionedCall/sequential_1_1/max_pooling2d_4_1/MaxPool2d", "StatefulPartitionedCall/sequential_1_1/separable_conv2d_3_1/separable_conv2d/ReadVariableOp"], "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/separable_conv2d_3_1/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential_1_1/separable_conv2d_3_1/separable_conv2d/depthwise", "StatefulPartitionedCall/sequential_1_1/separable_conv2d_3_1/separable_conv2d/ReadVariableOp_1", "StatefulPartitionedCall/sequential_1_1/separable_conv2d_3_1/Squeeze"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "VkFMSUQ="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/batch_normalization_3_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_1_1/separable_conv2d_3_1/BiasAdd", "StatefulPartitionedCall/sequential_1_1/batch_normalization_3_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/batch_normalization_3_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_1_1/batch_normalization_3_1/batchnorm/mul_1", "StatefulPartitionedCall/sequential_1_1/batch_normalization_3_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/leaky_re_lu_4_1/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/sequential_1_1/batch_normalization_3_1/batchnorm/add_1"], "attr": {"alpha": {"f": 0.1}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/max_pooling2d_5_1/MaxPool2d", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_1_1/leaky_re_lu_4_1/LeakyRelu"], "attr": {"ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "padding": {"s": "VkFMSUQ="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/separable_conv2d_4_1/separable_conv2d/depthwise", "op": "DepthwiseConv2dNative", "input": ["StatefulPartitionedCall/sequential_1_1/max_pooling2d_5_1/MaxPool2d", "StatefulPartitionedCall/sequential_1_1/separable_conv2d_4_1/separable_conv2d/ReadVariableOp"], "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/separable_conv2d_4_1/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential_1_1/separable_conv2d_4_1/separable_conv2d/depthwise", "StatefulPartitionedCall/sequential_1_1/separable_conv2d_4_1/separable_conv2d/ReadVariableOp_1", "StatefulPartitionedCall/sequential_1_1/separable_conv2d_4_1/Squeeze"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "VkFMSUQ="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/batch_normalization_4_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_1_1/separable_conv2d_4_1/BiasAdd", "StatefulPartitionedCall/sequential_1_1/batch_normalization_4_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/batch_normalization_4_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_1_1/batch_normalization_4_1/batchnorm/mul_1", "StatefulPartitionedCall/sequential_1_1/batch_normalization_4_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/leaky_re_lu_5_1/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/sequential_1_1/batch_normalization_4_1/batchnorm/add_1"], "attr": {"alpha": {"f": 0.1}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/max_pooling2d_6_1/MaxPool2d", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_1_1/leaky_re_lu_5_1/LeakyRelu"], "attr": {"ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "padding": {"s": "VkFMSUQ="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/separable_conv2d_5_1/separable_conv2d/depthwise", "op": "DepthwiseConv2dNative", "input": ["StatefulPartitionedCall/sequential_1_1/max_pooling2d_6_1/MaxPool2d", "StatefulPartitionedCall/sequential_1_1/separable_conv2d_5_1/separable_conv2d/ReadVariableOp"], "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/separable_conv2d_5_1/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential_1_1/separable_conv2d_5_1/separable_conv2d/depthwise", "StatefulPartitionedCall/sequential_1_1/separable_conv2d_5_1/separable_conv2d/ReadVariableOp_1", "StatefulPartitionedCall/sequential_1_1/separable_conv2d_5_1/Squeeze"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "VkFMSUQ="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/batch_normalization_5_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_1_1/separable_conv2d_5_1/BiasAdd", "StatefulPartitionedCall/sequential_1_1/batch_normalization_5_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/batch_normalization_5_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_1_1/batch_normalization_5_1/batchnorm/mul_1", "StatefulPartitionedCall/sequential_1_1/batch_normalization_5_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/leaky_re_lu_6_1/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/sequential_1_1/batch_normalization_5_1/batchnorm/add_1"], "attr": {"alpha": {"f": 0.1}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/max_pooling2d_7_1/MaxPool2d", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_1_1/leaky_re_lu_6_1/LeakyRelu"], "attr": {"padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/global_average_pooling2d_1_1/Mean", "op": "Mean", "input": ["StatefulPartitionedCall/sequential_1_1/max_pooling2d_7_1/MaxPool2d", "StatefulPartitionedCall/sequential_1_1/global_average_pooling2d_1_1/Mean/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_1_1/leaky_re_lu_7_1/LeakyRelu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_1_1/global_average_pooling2d_1_1/Mean", "StatefulPartitionedCall/sequential_1_1/dense_3_1/Cast/ReadVariableOp", "StatefulPartitionedCall/sequential_1_1/dense_3_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.1}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_4_1/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_1_1/leaky_re_lu_7_1/LeakyRelu", "StatefulPartitionedCall/sequential_1_1/dense_4_1/Cast/ReadVariableOp", "StatefulPartitionedCall/sequential_1_1/dense_4_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_5_1/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_1_1/dense_4_1/Relu", "StatefulPartitionedCall/sequential_1_1/dense_5_1/Cast/ReadVariableOp", "StatefulPartitionedCall/sequential_1_1/dense_5_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_5_1/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/sequential_1_1/dense_5_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_1_1/dense_5_1/Softmax"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1994}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/sequential_1_1/conv2d_1_1/convolution/ReadVariableOp", "shape": [5, 5, 1, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/conv2d_1_1/Squeeze", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/separable_conv2d_3_1/separable_conv2d/ReadVariableOp", "shape": [3, 3, 32, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/separable_conv2d_3_1/separable_conv2d/ReadVariableOp_1", "shape": [1, 1, 32, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/separable_conv2d_3_1/Squeeze", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/batch_normalization_3_1/batchnorm/mul", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/batch_normalization_3_1/batchnorm/sub", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/separable_conv2d_4_1/separable_conv2d/ReadVariableOp", "shape": [3, 3, 64, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/separable_conv2d_4_1/separable_conv2d/ReadVariableOp_1", "shape": [1, 1, 64, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/separable_conv2d_4_1/Squeeze", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/batch_normalization_4_1/batchnorm/mul", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/batch_normalization_4_1/batchnorm/sub", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/separable_conv2d_5_1/separable_conv2d/ReadVariableOp", "shape": [3, 3, 128, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/separable_conv2d_5_1/separable_conv2d/ReadVariableOp_1", "shape": [1, 1, 128, 256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/separable_conv2d_5_1/Squeeze", "shape": [256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/batch_normalization_5_1/batchnorm/mul", "shape": [256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/batch_normalization_5_1/batchnorm/sub", "shape": [256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/global_average_pooling2d_1_1/Mean/reduction_indices", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_3_1/Cast/ReadVariableOp", "shape": [256, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_3_1/BiasAdd/ReadVariableOp", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_4_1/Cast/ReadVariableOp", "shape": [128, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_4_1/BiasAdd/ReadVariableOp", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_5_1/Cast/ReadVariableOp", "shape": [64, 16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_5_1/BiasAdd/ReadVariableOp", "shape": [16], "dtype": "float32"}]}]}